app/views/classrooms/_form.html.erb

    <%= f.label :estudante %><br>
    <td><%= collection_select(:classroom, :student_id, Student.all, :id, :name)%>
---
SELECT "students".* FROM "students"

    <%= f.label :curso %><br>
    <td><%= collection_select(:classroom, :courses_id, Course.all, :id, :name)%>
---
SELECT "courses".* FROM "courses"