app/controllers/classrooms_controller.rb

  def index
    @classrooms = Classroom.all
---
SELECT "classrooms".* FROM "classrooms"

  def create
    @classroom = Classroom.new(classroom_params)

    respond_to do |format|
      if @classroom.save
---
INSERT INTO "classrooms" ("student_id", "courses_id", "entry_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["student_id", 2], ["courses_id", 3], ["entry_at", "2016-04-29 15:03:00.000000"], ["created_at", "2016-04-29 15:03:19.275875"], ["updated_at", "2016-04-29 15:03:19.275875"]]

    def set_classroom
      @classroom = Classroom.find(params[:id])
---
SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT 1  [["id", 1]]