app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "register_number", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ana Lucia "], ["register_number", "123456"], ["status", 1], ["created_at", "2016-04-29 15:04:47.602467"], ["updated_at", "2016-04-29 15:04:47.602467"]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "register_number" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["register_number", "321"], ["updated_at", "2016-04-29 15:35:25.889637"], ["id", 2]]